---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LoadFailures.PointLoadAllZero
source: html/6f3cc923-9c05-041a-21de-88c208776255.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LoadFailures.PointLoadAllZero Property

Point Load can't have all force components and moment components to be zero.

## Syntax (C#)
```csharp
public static FailureDefinitionId PointLoadAllZero { get; }
```